Tekla Open API Reference for Tekla Structures 2025
PreferredMarkPlacingTypes.AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType Method
 The object is placed using the along line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line and rotated to be at the same angle as the connected part.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PreferredPlacingTypeBase AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType()
Public Shared Function AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType As PreferredPlacingTypeBase
Return Value
Type: PreferredPlacingTypeBase
A new along line or with leader line and parent object along part placing type instance.
See Also
Reference
PreferredMarkPlacingTypes Class
Tekla.Structures.Drawing Namespace